In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
daily_prices = pd.read_parquet("data+files/sp500_daily_prices.parquet")

In [6]:
daily_prices.head(2)

           date  close symbol
2544 2010-01-04  31.30      A
2545 2010-01-05  30.96      A

In [4]:
apple = daily_prices.loc[daily_prices.symbol == "AAPL"]

In [5]:
apple.tail(2)

            date   close symbol
83068 2023-08-04  181.99   AAPL
83069 2023-08-07  179.32   AAPL

In [3]:
stocks = ( daily_prices
          .loc[daily_prices.symbol.isin(["AAPL", "IBM", "BA", "NVDA"])]
          .pivot(index="date", columns="symbol", values="close")
         )

In [7]:
stocks.head()

symbol        AAPL     BA     IBM    NVDA
date
2010-01-04  7.6432  56.18  132.45  4.6225
2010-01-05  7.6564  58.02  130.85  4.6900
2010-01-06  7.5346  59.78  130.00  4.7200
2010-01-07  7.5207  62.20  129.55  4.6275
2010-01-08  7.5707  61.60  130.85  4.6375